backend/app_api/app/helpers/application_helper.rb

  def requested_instance
    return @requested_instance if defined?(@requested_instance)
    api_key = request.headers['X-Swishjam-Instance-Api-Key'] || params[:api_key]
    return if api_key.blank?
    @requested_instance ||= Instance.find_by(public_key: api_key)
---
SELECT "instances".* FROM "instances" WHERE "instances"."public_key" = $1 LIMIT $2  [["public_key", "abc123"], ["LIMIT", 1]]