backend/instrumentation_api/app/lib/event_processors/base.rb

    def instance
      @instance ||= Instance.find_by!(public_key: @api_key)
---
SELECT "instances".* FROM "instances" WHERE "instances"."public_key" = $1 LIMIT $2  [["public_key", "abc-123"], ["LIMIT", 1]]

    def find_or_create_session
      @session ||= find_or_create_device.sessions.find_or_create_by!(unique_identifier: session_id) do |new_session|
---
INSERT INTO "devices" ("instance_id", "fingerprint", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["instance_id", 1], ["fingerprint", "2630776421"], ["created_at", "2023-08-02 20:01:58.405190"], ["updated_at", "2023-08-02 20:01:58.405190"]]

    def find_or_create_device
      @device ||= instance.devices.find_or_create_by!(fingerprint: fingerprint_value) do |new_device|
---
INSERT INTO "devices" ("instance_id", "fingerprint", "user_agent", "browser", "browser_version", "os", "os_version", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "devices".* FROM "devices" WHERE "devices"."instance_id" = $1 AND "devices"."fingerprint" = $2 LIMIT $3  [["instance_id", 2], ["fingerprint", "2630776421"], ["LIMIT", 1]]