backend/instrumentation_api/app/lib/event_processors/custom.rb

    def process!
      formatted_metadata = data.map{ |k, v| { key: k, value: v }}
      event = Event.create!(
        device: find_or_create_device,
        session: find_or_create_session,
        page_hit: find_or_create_page_hit,
        name: event_type,
        timestamp: timestamp,
        metadata_attributes: formatted_metadata
      )
---
INSERT INTO "events" ("device_id", "page_hit_id", "name", "timestamp", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["device_id", 1], ["page_hit_id", 2], ["name", "pdf downloaded"], ["timestamp", "2023-08-02 23:05:10"], ["created_at", "2023-08-02 23:05:21.126648"], ["updated_at", "2023-08-02 23:05:21.126648"]]
INSERT INTO "metadata" ("parent_type", "parent_id", "key", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["parent_type", "Event"], ["parent_id", 1], ["key", "filename"], ["value", "example.pdf"], ["created_at", "2023-08-02 23:05:21.131674"], ["updated_at", "2023-08-02 23:05:21.131674"]]

    def find_or_create_page_hit
      session = find_or_create_session
      session.page_hits.find_or_create_by!(unique_identifier: page_view_id) do |page_hit|
---
SELECT "page_hits".* FROM "page_hits" WHERE "page_hits"."session_id" = $1 AND "page_hits"."unique_identifier" = $2 LIMIT $3  [["session_id", 2], ["unique_identifier", "pv-4ec85ead-febc-b668-cb68-9b49950dabf3"], ["LIMIT", 1]]