backend/instrumentation_api/app/lib/event_processors/identify.rb

INSERT INTO "users" ("instance_id", "unique_identifier", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["instance_id", 1], ["unique_identifier", "user-123"], ["email", "hello@gmail.com"], ["created_at", "2023-08-07 20:17:33.378677"], ["updated_at", "2023-08-07 20:17:33.378677"]]
SELECT "users".* FROM "users" WHERE "users"."instance_id" = $1 AND "users"."unique_identifier" = $2 LIMIT $3  [["instance_id", 1], ["unique_identifier", "user-123"], ["LIMIT", 1]]
---
    def find_or_create_user!
      unique_identifier = data['user_id'] || data['userId']
      user = instance.users.find_or_create_by!(unique_identifier: unique_identifier) do |new_user|

UPDATE "devices" SET "user_id" = $1, "updated_at" = $2 WHERE "devices"."id" = $3  [["user_id", 1], ["updated_at", "2023-08-07 20:17:33.387065"], ["id", 1]]
---
    def update_devices_owner_if_necessary!(user)
      device = find_or_create_device
      if device.user != user
        Rails.logger.warn "Device #{device.id} changed ownership from #{device.user_id} to #{user.id}" if device.user_id
        device.update!(user: user)