backend/instrumentation_api/app/lib/event_processors/page_view.rb

    def process!
      PageHit.create!(
        device: find_or_create_device,
        session: find_or_create_session,
        unique_identifier: page_view_id,
        full_url: full_url,
        url_host: url_host,
        url_path: url_path,
        url_query: url_query,
        referrer_full_url: referrer_url,
        referrer_url_host: referrer_url_host,
        referrer_url_path: referrer_url_path,
        referrer_url_query: referrer_url_query,
        start_time: timestamp,
      )
---
INSERT INTO "page_hits" ("device_id", "session_id", "unique_identifier", "full_url", "url_host", "url_path", "referrer_full_url", "referrer_url_host", "referrer_url_path", "start_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"